finish vigilancia post and update opsec tools
